#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Date  : 2025/7/1 16:00
# @File  : disease_data.py.py
# @Author: johnson
# @Contact : github: johnson7788
# @Desc  :

disease_symptoms = {
    "高血压": (
        "大多数起病缓慢，缺乏特殊临床表现，导致诊断延迟，仅在测量血压时或发生心、脑、肾等并发症时才被发现。"
        "常见症状有头晕、头痛、颈项板紧、疲劳、心悸等，也可出现视物模糊、鼻出血等较重症状，"
        "典型的高血压头痛在血压下降后即可消失。高血压病人可以同时合并其他原因的头痛，往往与血压水平无关，"
        "例如精神焦虑性头痛、偏头痛、青光眼等。如果突然发生严重头晕与眩晕，要注意可能是脑血管病或者降压过度、"
        "直立性低血压。高血压病人还可以出现受累器官的症状，如胸闷、气短、心绞痛、多尿等。"
        "另外，有些症状可能是降压药的不良反应所致。"
    ),
    "糖尿病": (
        "代谢紊乱症状群。血糖升高后因渗透性利尿引起多尿，继而口渴多饮；"
        "外周组织对葡萄糖利用障碍，脂肪分解增多，蛋白质代谢负平衡，渐见乏力、消瘦，儿童生长发育受阻；"
        "病人常有易饥、多食。故糖尿病的临床表现常被描述为“三多一少”，即多尿、多饮、多食和体重减轻。"
        "可有皮肤瘙痒，尤其外阴瘙痒。血糖升高较快时可使眼房水、晶状体渗透压改变而引起屈光改变致视物模糊。"
        "许多病人无任何症状，仅于健康检查或因各种疾病就诊化验时发现高血糖。"
    ),
    "高脂血症": (
        "高脂血症的临床表现主要包括两大方面："
        "①脂质在真皮内沉积所引起的黄色瘤；"
        "②脂质在血管内皮沉积所引起的动脉粥样硬化，产生冠心病和周围血管病等。"
        "由于高脂血症时黄色瘤的发生率并不十分高，动脉粥样硬化的发生和发展则需要相当长的时间，"
        "所以多数高脂血症患者并无任何症状和异常体征发现。"
        "而患者的高脂血症则常常是在进行血液生化检验（测定血胆固醇和甘油三酯）时被发现的。"
    )
}
